app/controllers/hellos_controller.rb

SELECT * FROM `hellos`
---
  def index
    @hellos = Hello.all

SELECT * FROM "hellos" WHERE ("hellos"."id" = 1)
---
  def show
    @hello = Hello.find(params[:id])

INSERT INTO "hellos" ("created_at", "updated_at", "s") VALUES('2010-02-26 03:07:46', '2010-02-26 03:07:46', NULL)
---
  def create
    @hello = Hello.new(params[:hello])

    respond_to do |format|
      if @hello.save

SELECT * FROM `hellos` WHERE (`hellos`.`id` = 3)
DELETE FROM `hellos` WHERE `id` = 3
---
  def destroy
    @hello = Hello.find(params[:id])
    @hello.destroy